УправДом/src/Documents/ОплатаИнтернет/ОплатаИнтернет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаИнтернет</name>
  <registerRecords>InformationRegister.СведенияПоИнтернету</registerRecords>
  <attributes>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопУслугиИнтернет</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопУслугиИнтернетВыбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПлатежа</name>
    <attributes>
      <name>ЦенаИнтернет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДопУслугиИнтернет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/СведенияПоИнтернету/СведенияПоИнтернету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоИнтернету</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопУслугиИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяцаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/ОплатаИнтернет/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	 	//проверка, существует ли платеж за этот месяц	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаИнтернет.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумента,
		|	СведенияПоИнтернету.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцРегистратора
		|ИЗ
		|	РегистрСведений.СведенияПоИнтернету КАК СведенияПоИнтернету
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаИнтернет КАК ОплатаИнтернет
		|		ПО СведенияПоИнтернету.ОплачиваемыйМесяц = ОплатаИнтернет.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаИнтернет.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой()Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();
	КонецЕсли;
	
	// регистр СведенияПоИнтернету
	Движения.СведенияПоИнтернету.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоИнтернету.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.ЦенаИнтернет = ТекСтрокаДанныеПлатежа.ЦенаИнтернет;
		Если ДопУслугиИнтернетВыбор = Истина Тогда 
		     Движение.ДопУслугиИнтернет = ТекСтрокаДанныеПлатежа.ЦенаДопУслугиИнтернет;
	    Иначе 
		     Движение.ДопУслугиИнтернет = 0;
		КонецЕсли;
		 
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
